class ques_ans {
  // attribute
  String title = "";
  String question = "";
  String answer = "";
  // constructor
  ques_ans(this.title, this.question, this.answer);
}

var questions = {
  '冷笑話': {
    '0': ques_ans('永不下雨', '哪一條街永不下雨?', '茉莉花，因為：好一朵美麗（沒力）的茉莉花'),
    '1': ques_ans('老婆最虛弱', '酷酷哥.酷帥哥.帥酷哥.請問哪一個人ㄉ老婆身體最虛弱?', '酷酷哥，因為他的老婆叫酷酷嫂'),
    '2': ques_ans('孔子徒弟', '孔子有三位徒弟子貢.子路.和子游,請問哪一位不是人？', '子路，因為指鹿為馬（子路為馬）'),
    '3': ques_ans('布與紙', '布跟紙怕什麼?', '不怕一萬只怕萬一 (布怕一萬紙怕萬一)'),
    '4': ques_ans('蚊子', '有一隻蚊子牠只叮[鼠牛虎兔龍蛇馬羊猴雞豬]，請問這隻蚊子叫什麼名字?', '布丁狗（不叮狗）')
  },
  '愛情': {
    '0': ques_ans('一見鍾情', '請說出一部男女主角一見鍾情的電視劇名?', '《親愛的，熱愛的》（佟年一見鍾情於韓商言）'),
    '1': ques_ans('追女友', '請提出兩個男生追女生的方法?', '1. 平時陪她做無聊小事, 2. 心情低落時的陪伴'),
    '2': ques_ans('尷尬', '與新女友約會時遇到前女友，若您是主角，會怎麼應對?', '裝作若無其事和普通朋友一樣，稍作回應就馬上拉著先女友走開就好了，千萬不要給前女友很多的說話機會，說的越多暴露的概率越大。')
  },
  '運動': {
    '0': ques_ans('棒球', '請舉出一個近五年出名的台灣棒球明星?', '吳念庭')
  },
  '政治': {
    '0': ques_ans('總統', '請說出一個歷任遇刺的美國總統?', '約翰·F·甘迺迪')
  },
  '新冠肺炎': {
    '0': ques_ans('爆發年分', '請問新冠開始流行的年份?', '2020')
  }
};