class ques_ans {
  // attribute
  String title = "";
  String question = "";
  // constructor
  ques_ans(this.title, this.question);
}

final questions = {
  '愛情': {
    '0': ques_ans('初戀', '是爺爺/奶奶嗎?\n在哪裡認識的?\n後續有再聯繫嗎?'),
    '1': ques_ans('與爺爺/奶奶初次見面', '怎麼認識的?在哪裡?\n初印象怎麼樣?跟現印象差很多嗎?\n那時候有想過會結婚嗎?'),
    '2': ques_ans('戀愛過程', '誰先告白的?\n會去約會嗎?都去哪裡約會?會準備甚麼?\n有什麼有趣的事情嗎?'),
    '3': ques_ans('求婚', '是誰求的婚?\n怎麼求婚?是怎樣的情景?\n有馬上答應嗎?'),
    '4': ques_ans('婚禮', '婚紗照或是結婚的照片有留著嗎?\n婚紗還留著嗎?是誰選的呀?\n當時結婚是怎麼樣的?流程?儀式?')
  },
  '童年': {
    '0': ques_ans('家族', '那時候家裡有誰?\n房子跟現在的是同一個嗎?有什麼區別呢?\n那時後家裡是做什麼的?'),
    '1': ques_ans('上學', '那時候能去上學嗎?\n(有)上課是個什麼樣情境?跟現在有什麼不同嗎?\n(無)那麼平時都要做什麼呢?'),
    '2': ques_ans('玩', '會去哪裡玩?\n那時候的童玩有哪些?\n有什麼有趣的事情嗎?'),
    '3': ques_ans('生活', '那時候都吃什麼東西呀?\n那時候平常都在幹嘛?\n有發生什麼特別的事情嗎?'),
    '4': ques_ans('其他', '你覺得你小時候跟我們小時候哪裡差最多?\n有什麼遺憾的事情嗎?\n最懷念什麼?')
  },
  '工作': {

  },
  '時事': {

  },
  '軍旅': {

  },
  '娛樂': {

  }
};